/*
*********************************************************************************************************
*                                            ERROR TYPE DEFINE
*
*                          (c) Copyright 2002-2009, Yongjik Park. NETGENETECH
*                                           All Rights Reserved
* Date : 2009-10-01
* File : Errors.h
* By   : Yongjik Park
*********************************************************************************************************
*/
#ifndef __ERRORS_H__
#define __ERRORS_H__


#ifdef __cplusplus
extern "C"
{
#endif
/*
*********************************************************************************************************
*	ERROR NUMBER 정의
*********************************************************************************************************
*/
#define NO_ERROR    0
#define ECOMMAND    1           // 모르는 명령이에요.
#define EUNKNOWNARG 2           // 모르는 아규먼트에요..
#define EMOREARG    10          // Argument가 모자라요...
#define EINVALID    11          // 잘못된 값이에요.
#define EEXECUTE    99          // 실행 에러 에요

#define NO_PROMPT   100         // PromPt 표시하지마라

#ifdef __cplusplus
}
#endif
/*
*********************************************************************************************************
*	END
*********************************************************************************************************
*/
#endif